{
  "header": {
    "name": {
      "firstName": "Mark Jay",
      "middleName": "Villablanca",
      "lastName": "Cada"
    },
    "role": "Software Engineer, Front-end",
    "contact": {
      "email": "mjvcada@gmail.com",
      "mobile": "+63 969 562 5826",
      "telephone": "+63 7343 7327",
      "location": "Mandaluyong, Philippines",
      "github": "https://github.com/mxrkjxy",
      "linkedIn": "https://www.linkedin.com/in/markjaycada"
    }
  },
  "body": {
    "summary": {
      "descriptions": [
        "Results-driven software engineer with over 4 years of experience in front-end web development, specializing in e-commerce solutions. Eager to contribute to a dynamic team where I can continue to grow professionally, enhance my technical expertise, and support the organization in achieving its business objectives through the application of both proven experience and continuous learning."
      ]
    },
    "education": {
      "universities": [
        {
          "name": "Polytechnic University of the Philippines - Sta. Mesa",
          "degree": "Bachelor of Science in Computer Engineering",
          "yearStarted": 2015,
          "yearGraduated": 2020,
          "location": "Manila, Philippines",
          "awards": ["DOST-SEI Scholar (2018 - 2020)"]
        }
      ]
    },
    "certifications": [
      {
        "name": "",
        "year": "",
        "location": "",
        "description": []
      }
    ],
    "workExperience": {
      "companies": [
        {
          "name": "Infor PSSC, Inc.",
          "location": "Bonifacio Global City, Taguig, Philippines",
          "role": "Software Engineer",
          "startDate": {
            "month": "April",
            "year": 2022
          },
          "endDate": {
            "month": "",
            "year": ""
          },
          "description": [
            "Contributed to the migration of the legacy codebase from Backbone.js and Marionette.js to modern React with Redux. Developed new reusable React components based on modern design patterns, helping streamline UI development for future features.",
            "Refactored legacy utility functions and shared modules to align with modern JavaScript best practices, resulting in improved code readability, easier debugging, and better long-term scalability.",
            "Proactively handled CI/CD issues, such as debugging pipeline failures. Participated in the deployment process in hotfix environments, taking ownership of high-priority maintenance tasks and ensuring critical fixes reached production with minimal downtime.",
            "Acted as a technical resource for peers, offering consultation and guidance on complex issues across the frontend stack, contributing to team problem-solving and knowledge sharing.",
            "Collaborated in the design and development of a new feature integrating Generative AI (GenAI) capabilities, contributing from early planning through implementation. Worked closely with product managers, designers, and backend teams to ensure a smooth and cohesive user experience."
          ],
          "awards": ["Rhythm Rockstar (January 2024)"]
        },
        {
          "name": "Infor PSSC, Inc.",
          "location": "Bonifacio Global City, Taguig, Philippines",
          "role": "Software Engineer, Associate",
          "startDate": {
            "month": "January",
            "year": 2021
          },
          "endDate": {
            "month": "March",
            "year": 2022
          },
          "description": [
            "Took ownership of front-end maintenance tasks for both web and mobile platforms by efficiently addressing and resolving tickets related to UI bugs, visual inconsistencies, responsiveness issues, and browser or device compatibility—ensuring a seamless and consistent user experience across various environments.",
            "Actively participated in diagnosing and resolving production issues, often collaborating with cross-functional teams to investigate root causes and deliver timely, stable fixes.",
            "Provided urgent hotfixes for critical issues reported in live environments, minimizing downtime and ensuring business continuity.",
            "Successfully delivered several front-end feature enhancements, applying the principles of the Software Development Life Cycle (SDLC), from planning and requirement analysis to development, testing, and deployment.",
            "Collaborated closely with QA engineers, back-end developers, UX designers, and business analysts to ensure feature completeness, functional accuracy, and seamless user experiences—resulting in the successful and timely delivery of key product features.",
            "Provided tailored solutions to customer-specific theming issues, ensuring branding consistency and satisfaction across various clients with unique UI and styling needs.",
            "Took responsibility for bumping application version numbers during code lock phases, supporting the release process and ensuring consistency across environments.",
            "Developed and presented Proof of Concept (PoC) implementations to internal stakeholders, helping validate design assumptions and facilitating informed decision-making for future development.",
            "Regularly presented accomplishments, progress, and upcoming plans during Sprint Review meetings, contributing to team transparency and stakeholder engagement.",
            "Participated in code reviews with peers, promoting a collaborative environment focused on continuous improvement and the adoption of best practices, clean code, and maintainable architecture. "
          ]
        }
      ]
    },
    "skills": {
      "technologies": [
        {
          "languages": [
            "JavaScript",
            "HTML5",
            "CSS",
            "SCSS",
            "Sass",
            "JSON",
            "Python"
          ]
        },
        {
          "libraries": [
            "React",
            "Redux",
            "Redux Toolkit",
            "Axios",
            "Backbone.js",
            "jQuery",
            "Handlebars.js",
            "Underscore.js",
            "Lodash",
            "Moment.js",
            "Jest"
          ]
        },
        {
          "frameworks": [
            "Marionette.js",
            "Bootstrap",
            "Tailwind CSS",
            "Angular",
            "Express.js"
          ]
        },
        {
          "tools": [
            "VS Code",
            "Node.js",
            "Git",
            "Bash",
            "GitHub",
            "GitLab",
            "Jenkins",
            "Swagger",
            "Jira",
            "Postman",
            "Liferay",
            "Browserstack"
          ]
        },
        {
          "others": ["REST APIs", "Agile", "Scrum", "DevOps", "CI/CD"]
        }
      ],
      "softSkills": [
        "Problem-solving",
        "Critical thinking",
        "Teamwork",
        "Collaboration",
        "Communication",
        "Adaptability",
        "Time management",
        "Attention to detail",
        "Creativity"
      ],
      "languages": [
        {
          "name": "English",
          "level": "Fluent"
        },
        {
          "name": "Filipino",
          "level": "Native"
        }
      ]
    },
    "projects": [
      {
        "name": "",
        "description": "",
        "technologies": [],
        "link": ""
      }
    ]
  }
}
